/*
"e":完美氮气
"b":刹车停气
"w":双喷
"q":360
"s":切气
(引号均为英文引号)
1：右滑选路一次并按一次氮气
2：右滑选路两次并按一次氮气
3: 右滑选路三次并按一次氮气
-1: 左滑选路一次并按一次氮气
-2: 左滑选路两次并按一次氮气
-3: 左滑选路三次并按一次氮气
10:按住漂移 1 秒，漂移结束后右滑选路一次并双喷加速
23: 按住漂移 2.3 秒，漂移结束后右滑选路一次并双喷加速
...
105: 按住漂移 10.5 秒，漂移结束后右滑选路一次并双喷加速
(正整数即可，上不封顶)
-10:按住漂移 1 秒，漂移结束后左滑选路一次并双喷加速
-23: 按住漂移 2.3 秒，漂移结束后左滑选路一次并双喷加速
...
-105: 按住漂移 10.5 秒，漂移结束后左滑选路一次并双喷加速
(负整数即可，下不封顶)
*/
const myMap = [
  {
    mapName:'沙漠狂奔',
    note:'在多人赛事中使用，3个或更少氮气瓶的路线，完成通行证任务。',
    date:'2021-8-21',
    runningArray:[
      9,-3,10,-3,11,-3,
      22,"w",
      31,"w",
      37,"w",
      50,60,
      62,3,63,3,64,3,
      77,"w",
      78,150
    ]
  },
  {
    mapName:'沙漠狂奔2',
    note:'在寻车赛事中使用，跑法保守但稳定，适合488、福特GT、DBS、718GT4等。',
    date:'2021-8-1',
    runningArray:[
      1,1,
      4,1,5,50,
      10,1,11,-69,
      22,1,23,1,
      27,"w",28,"w",
      29,"b",31,"b",
      34,"w",35,"b",
      37,"q",38,"w",39,"s",41,"w",
      50,50,
      61,"e",
      66,40,71,1,72,1,73,1,
      74,"w",75,"w",76,"w",
      77,85,
      86,70,94,"w",95,"w",96,"w",97,"w",98,"w",99,"w"
    ],
  },
]

export default myMap